the_simulation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.10;

vertices
(
    (0 0 0)
    (6 0 0)
    (0 10 0)
    (6 10 0)
    (0 0 0.1)
    (6 0 0.1)
    (0 10 0.1)
    (6 10 0.1)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (300 600 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 4 6 2)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (1 5 7 3)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (2 6 7 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
