the_simulation/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    arch        "LSB;label=32;scalar=64";
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       359100;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       359700;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       360300;
    }
    atmosphere
    {
        type            patch;
        nFaces          300;
        startFace       360600;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          360000;
        startFace       360900;
    }
)

// ************************************************************************* //
