the_simulation/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (0.155 0.035 -1) (0.185 0.065 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

    boxToCell
    {
        box (0.235 0.085 -1) (0.265 0.115 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

    boxToCell
    {
        box (0.42 0.085 -1) (0.45 0.115 1);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }


);


// ************************************************************************* //
